// const todos = [
//     {
//         "userId": 1,
//         "id": 1,
//         "title": "เอกสารรายงานการประชุม 1",
//         "date": "2024-11-01",
//         "time": "การเงิน",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 2,
//         "title": "เอกสารการประเมินผลการทำงาน",
//         "date": "2024-10-20",
//         "time": "ทรัพยากรมนุษย์",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 3,
//         "title": "เอกสารคำแนะนำการใช้งานระบบ",
//         "date": "2024-02-22",
//         "time": "เทคโนโลยีสารสนเทศ",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 4,
//         "title": "รายงานสรุปการประชุมเดือนตุลาคม",
//         "date": "2024-10-15",
//         "time": "การเงิน",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 5,
//         "title": "เอกสารการขออนุมัติงบประมาณ",
//         "date": "2024-09-30",
//         "time": "การเงิน",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 6,
//         "title": "รายงานการตรวจสอบบัญชี",
//         "date": "2024-11-05",
//         "time": "การเงิน",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 7,
//         "title": "สัญญาการจ้างงานพนักงานใหม่",
//         "date": "2024-10-01",
//         "time": "ทรัพยากรมนุษย์",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 8,
//         "title": "เอกสารการจัดทำแผนงานปี 2025",
//         "date": "2024-11-12",
//         "time": "วางแผน",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 9,
//         "title": "รายงานผลการดำเนินงานไตรมาส 1",
//         "date": "2024-09-25",
//         "time": "การเงิน",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 10,
//         "title": "เอกสารขอทุนสนับสนุนวิจัย",
//         "date": "2024-08-15",
//         "time": "วิจัย",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 11,
//         "title": "สรุปการฝึกอบรมพนักงาน",
//         "date": "2024-11-10",
//         "time": "ทรัพยากรมนุษย์",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 12,
//         "title": "คู่มือการใช้งานซอฟต์แวร์ภายใน",
//         "date": "2024-07-01",
//         "time": "เทคโนโลยีสารสนเทศ",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 13,
//         "title": "เอกสารการประชุมคณะกรรมการ 2",
//         "date": "2024-10-12",
//         "time": "การประชุม",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 14,
//         "title": "เอกสารการประเมินความเสี่ยง 2025",
//         "date": "2024-06-25",
//         "time": "ความเสี่ยง",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 15,
//         "title": "แผนพัฒนาองค์กรปี 2025",
//         "date": "2024-09-10",
//         "time": "วางแผน",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 16,
//         "title": "เอกสารการตรวจสอบประสิทธิภาพการทำงาน",
//         "date": "2024-11-20",
//         "time": "การตรวจสอบ",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 17,
//         "title": "รายงานผลการศึกษาภาคสนาม",
//         "date": "2024-10-18",
//         "time": "วิจัย",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 18,
//         "title": "เอกสารขออนุมัติจัดหาวัสดุ",
//         "date": "2024-08-02",
//         "time": "การจัดซื้อ",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 19,
//         "title": "รายงานการประเมินโครงการ 2024",
//         "date": "2024-10-28",
//         "time": "การประเมิน",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 20,
//         "title": "เอกสารการฝึกอบรมพนักงานใหม่",
//         "date": "2024-11-15",
//         "time": "ทรัพยากรมนุษย์",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 21,
//         "title": "เอกสารแผนการประชุมปี 2024",
//         "date": "2024-09-05",
//         "time": "การประชุม",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 22,
//         "title": "รายงานการทบทวนงบประมาณ 2024",
//         "date": "2024-11-08",
//         "time": "การเงิน",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 23,
//         "title": "เอกสารคำขออนุมัติสินเชื่อ",
//         "date": "2024-09-12",
//         "time": "การเงิน",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 24,
//         "title": "แผนการวิจัยและพัฒนา 2025",
//         "date": "2024-10-22",
//         "time": "วิจัย",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 25,
//         "title": "รายงานการสำรวจความคิดเห็นพนักงาน",
//         "date": "2024-11-03",
//         "time": "ทรัพยากรมนุษย์",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 26,
//         "title": "รายงานการพัฒนาและประเมินผลโครงการ",
//         "date": "2024-11-01",
//         "time": "การประเมิน",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 27,
//         "title": "เอกสารการอนุมัติขยายเวลาโครงการ",
//         "date": "2024-09-18",
//         "time": "การจัดการโครงการ",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 28,
//         "title": "การบันทึกข้อมูลและการสำรองข้อมูล",
//         "date": "2024-10-30",
//         "time": "เทคโนโลยีสารสนเทศ",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 29,
//         "title": "เอกสารขอเพิ่มงบประมาณโครงการ",
//         "date": "2024-11-07",
//         "time": "การเงิน",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 30,
//         "title": "รายงานการวิเคราะห์ข้อมูล 2024",
//         "date": "2024-11-12",
//         "time": "วิจัย",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 31,
//         "title": "เอกสารการตรวจสอบภายใน 2024",
//         "date": "2024-09-14",
//         "time": "การตรวจสอบ",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 32,
//         "title": "รายงานการวิเคราะห์ข้อมูล 2024",
//         "date": "2024-11-07",
//         "time": "วิจัย",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 33,
//         "title": "เอกสารการตรวจสอบภายใน 2023",
//         "date": "2023-09-16",
//         "time": "การตรวจสอบ",
//         "completed": false
//     },
//     {
//         "userId": 1,
//         "id": 34,
//         "title": "รายงานการวิเคราะห์ข้อมูล 2022",
//         "date": "2024-08-2",
//         "time": "วิจัย",
//         "completed": true
//     },
//     {
//         "userId": 1,
//         "id": 35,
//         "title": "เอกสารการตรวจสอบภายใน 2020",
//         "date": "2020-02-1",
//         "time": "การตรวจสอบ",
//         "completed": false
//     }
// ];





// export function fetchTodos() {
//     return todos
//     // return todos.slice(0,10)
//     //return []
// }
